Revit 2027 API
LayerModifier(ModifierType, String) Constructor
 Constructs a new LayerModifier with modifierType and separator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LayerModifier(
	ModifierType modifierType,
	string separator
)
Public Sub New (
	modifierType As ModifierType,
	separator As String
)
public:
LayerModifier(
	ModifierType modifierType,
	String^ separator
)
new :
        modifierType : ModifierType *
        separator : string -> LayerModifier
Parameters
modifierType ModifierType
 The modifier type.
separator String
 The separator string that will follow this modifier in the export layer name.
Exceptions
Exception | Condition
ArgumentException |  The provided separator contains invalid characters (most special characters are invalid).
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LayerModifier Class
LayerModifier Overload
Autodesk.Revit.DB Namespace